[display]
width = 800		;窗口大小
height = 600		;窗口大小

[version]
version = 1.2.2.0	;版本号

[section]
id = 90001		;大区ID

[zone_server]
num = 1			;连接的loongworld的数量

[zone_session]  	;和ZoneServer通信参数
port = 5050		;和LoongWorld通信的端口

[player_session] 	;和客户端通信参数
port = 4200	 	;和客户端通信的端口

[zone0]
id = 30001		;游戏世界ID
name = 香蕉		;游戏世界名称
auto_seal = 1		;反外挂程序是否自动封号
attachserver=	;testworld01^testworld02	;附属world服务，多个用，隔开

[database]
ip		= 127.0.0.1	;帐号库IP
user	= root		;用户名
psd		= 123456	;密码
name	= ll_login	;帐号库数据库名
port    = 3306		;mysql服务器端口号

[world_state]
update_time = 5000;	;世界人数状态DB更新时间（毫秒）
insert_time = 10000

[gm_server]
ip = 127.0.0.1		;GMServerIP
port = 6600		;GMServer端口

[golden_code]
login_server = 300	;LoginServer的金色代码
zone_server =  292	;LoongWorld的金色代码

[proof]
policy = 0		;验证策略，0——普通策略 1——中央激活策略
			;2——迅雷验证 3——台湾游戏橘子 4 —— 盛大圈圈  5 —— 韩国游戏玉米棒
			;6 —— 越南版本 7——OMG 8——新加坡 9——豆客登录模式

[quanquan]
;盛大圈圈都用，其他模式不需这个部分
billingip = 127.0.0.1
;UDP server IP
billingport = 5001
;UDP port

[fatigue_guard]
;海外：不模拟防沉迷服务器，不开启防沉迷
;外服：不模拟防沉迷服务器，开启防沉迷
;精英：模拟防沉迷服务器，开启防沉迷

sim_server		= 1;	模拟防沉迷服务器
guard_switch	= 1; 防沉迷开关

;下面选项是防沉迷服务器相关的设置，只有在开启防沉迷时有效
ip	=	220.248.115.18	;防沉迷服务器的ip
port	=	12345		;防沉迷服务器的端口
circle =	1 			;（ 单位 秒）向fatigue_server发所有当前在线防沉迷玩家帐号的周期

[mixedserver]
YY_On     = 0       ;混服开关


[gm_login]
on     = 0       ;GM登入免排队开关 1 开,0 关 台湾专用
num    = 2       ;ip个数
ip1    = 127.0.0.1 ; 
ip2    = 172.17.3.21 ;  

[web_loginmode]
WebLogin_On      =   1;
Num    		 =   3;
URL1		 =   http://172.17.1.110/1.bmp	;  运营商图标下载地址
RechargeURL1 	 =   http://passport.gamall.net/reg.jsp	;  直冲URL 
LoginURL1	 =   http://passport.gamall.net/reg.jsp	;  登入URL链接 不得超过72字符
DescName1	 =   新浪;   运营商提示(不得超过9个字)
CropID1 	 =   10048;

URL2		 =   http://172.17.1.110/10.bmp	;  运营商图标下载地址
RechargeURL2     =   http://passport.gamall.net/reg.jsp	;  直冲URL
LoginURL2	 =   http://passport.gamall.net/reg.jsp	;  登入URL链接 
DescName2	 =   人人网; 运营商提示(不得超过9个字)
CropID2		 =   10047;

URL3		 =   http://172.17.1.110/11.bmp	;  运营商图标下载地址
RechargeURL3 	 =   http://passport.gamall.net/reg.jsp	;  直冲URL
LoginURL3	 =   http://passport.gamall.net/reg.jsp	;  登入URL链接 
DescName3	 =   腾讯微博; 运营商提示(不得超过9个字)
CropID3		 =   10046;